Revit 2024 API
AssetPropertyDistance Class
 Represents a property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyDistance : AssetProperty
Visual Basic
Public Class AssetPropertyDistance _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDistance : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDistance
See Also
AssetPropertyDistance Members
Autodesk.Revit.DB.Visual Namespace